In [1]:
import pandas as pd

all_skills = 'skills/Skills.xlsx'
digital_skills = 'skills/Digital Skills.xlsx'

In [2]:
def extract_skills(file_name):
    xl_file = pd.ExcelFile(file_name)
    dfs = {sheet_name: xl_file.parse(sheet_name) for sheet_name in xl_file.sheet_names}
    all_skills = []
    for key, df in dfs.items():
        all_skills.extend(df['Skill'].unique().tolist())
    df_skills = pd.DataFrame({'skill': all_skills})
    return df_skills.drop_duplicates()

def parent_check(file_name, df_skills):
    xl_file = pd.ExcelFile(file_name)
    dfs = {sheet_name: xl_file.parse(sheet_name) for sheet_name in xl_file.sheet_names}
    for key, df in dfs.items():
        df_error = df.loc[~df['Parent'].isin(df_skills['skill'])]
        print(df_error['Parent'].unique())

def extract_relation(file_name, df_skills):
    xl_file = pd.ExcelFile(file_name)
    dfs = {sheet_name: xl_file.parse(sheet_name) for sheet_name in xl_file.sheet_names}
    df_rel = pd.DataFrame(columns=['Skill', 'Parent'])
    skill_to_id_dict = df_skills.set_index('skill').to_dict()['skill_id']
    for key, df in dfs.items():
        df_rel = df_rel.append(df.replace(skill_to_id_dict))
    df_rel = df_rel.reset_index(drop=True)
    df_rel = df_rel.dropna()
    df_rel = df_rel.drop_duplicates()
    df_rel['Parent'] = df_rel['Parent'].astype(int)
    return df_rel

### Extract Skills

In [23]:
# All skills
df_s1 = extract_skills(all_skills)
df_s1.head()

              skill
0   Applied Science
1              Arts
2          Business
3  Computer Science
4      Data Science

In [24]:
df_s1.describe(include='object')

              skill
count          1639
unique         1639
top     Prototyping
freq              1

In [25]:
# Digital skills
df_s2 = extract_skills(digital_skills)
df_s2.head()

                     skill
0            Data Analysis
1         Machine Learning
2                Algorithm
3  Artificial Intelligence
4                 Big Data

In [26]:
df_s2.describe(include='object')

                         skill
count                      979
unique                     979
top     Sliding-window Methods
freq                         1

In [27]:
# Combine
df_skills = df_s1.append(df_s2)
df_skills = df_skills.drop_duplicates()
df_skills['skill_id'] = df_skills.groupby('skill').grouper.group_info[0]
df_skills = df_skills.reset_index(drop=True)
df_skills = df_skills[['skill_id', 'skill']]
df_skills.describe(include='object')

            skill
count        2451
unique       2451
top     Bootstrap
freq            1

### Data Checking/Cleaning

In [28]:
parent_check(all_skills, df_skills)

[nan]
[]
[]
[]
[]
[]

In [29]:
parent_check(digital_skills, df_skills)

[nan]
[]
[]
[]
[]
[]

### Extract Relation

In [30]:
df_r1 = extract_relation(all_skills, df_skills)
df_r2 = extract_relation(digital_skills, df_skills)
# Combine
df_rel = df_r1.append(df_r2)
df_rel = df_rel.drop_duplicates()
df_rel = df_rel.reset_index(drop=True)
df_rel = df_rel.rename(columns={'Skill': 'skill_1_id', 'Parent': 'skill_2_id'})
df_rel.head()

  skill_1_id  skill_2_id
0       1219        1461
1       1688        1461
2       2227         426
3       2227        1316
4         52         121

In [31]:
df_rel.describe(include='all')

        skill_1_id   skill_2_id
count       2919.0  2919.000000
unique      2442.0          NaN
top         1931.0          NaN
freq           7.0          NaN
mean           NaN  1167.078452
std            NaN   701.799314
min            NaN     0.000000
25%            NaN   546.000000
50%            NaN  1219.000000
75%            NaN  1759.000000
max            NaN  2442.000000

### Export

In [32]:
df_skills.to_csv('skills_db/skill.csv', index=False)
df_rel.to_csv('skills_db/skill_tree.csv', index=False)